/*********************************************Copyright (c)***********************************************
**                                Guangzhou ZLG MCU Technology Co., Ltd.
**
**                                        http://www.zlgmcu.com
**
**      广州周立功单片机科技有限公司所提供的所有服务内容旨在协助客户加速产品的研发进度，在服务过程中所提供
**  的任何程序、文档、测试结果、方案、支持等资料和信息，都仅供参考，客户有权不使用或自行参考修改，本公司不
**  提供任何的完整性、可靠性等保证，若在客户使用过程中因任何原因造成的特别的、偶然的或间接的损失，本公司不
**  承担任何责任。
**                                                                        ——广州周立功单片机科技有限公司
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               system.h
** Latest modified Date:    2012-09-04
** Latest Version:          V1.00
** Descriptions:            类型重定义文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              Bianrufeng
** Created date:            2012-09-04
** Version:                 V1.00
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __SYSTEM_H
#define __SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif  

/*********************************************************************************************************
  类型重定义
*********************************************************************************************************/

typedef signed char          s8;
typedef unsigned char        u8;
typedef signed short         s16;
typedef unsigned short       u16;
typedef signed long          s32;
typedef unsigned long        u32;
typedef signed long long     s64;
typedef unsigned long long   u64;
typedef float                FP32;
typedef double               FP64;

typedef unsigned char       Bool;



#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /* __SYSTEM_H                   */

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
